#include <stdio.h>

int main() {
    int  a, a2;
    printf ("Введите число в 8-ой с.с.\n");
    scanf ("%o", &a);
    printf ("Ваше число в 10-ой с.с. - %d\n", a);
    printf ("Ваше число в 8-ой с.с. - %o\nВаше число в 8-ой с.с., сдвинутое влево на 1 бит - %o\n", a, a);
    printf ("Ваше число в 8-ой с.с. - %o\nВаше число в 8-ой с.с., применения к нему битовой операции отрицания - %o\n", a, ~a);
    printf ("Введите еще одно число в 8-ой с.с.\n");
    scanf ("%o", &a2);
    printf ("Операция и - %o", a&&a2);
    return 0;
}
